dictionary = {"Имя": ["Андрей", "Кирилл", "Анна", "Евгений", "Евгений", "Александр", "Татьяна", "Аркадий", "Игорь", "Кирилл"],
              "Фамилия": ["Иванов", "Лазарев", "Петрова", "Надобников", "Никитин", "Иванов", "Никитина", "Лихачев", "Никитин", "Левашев"],
              "Город проживания": ["Москва", "Омск", "Псков", "Псков", "Москва", "Псков", "Москва", "Омск", "Псков", "Москва"],
              "Год рождения": [2000, 1987, 2003, 1993, 2001, 2001, 1976, 1957, 1969, 1999],
              "Месяц рождения": [6, 4, 11, 12, 9, 9, 5, 2, 3, 6],
              "Число рождения": [11, 25, 5, 3, 27, 31, 13, 12, 28, 24],
              "Статус": ["Студент", "Работает", "Школьница", "Работает", "Студент", "Студент", "Работает", "Пенсия", "Работает", "Студент"]
              }

update1 = {"Имя": ["Андрей", "Кириллл", "Анна", "Евгений", "Евгений", "Александр", "Татьяна", "Игорь", "Кириллл"],
           "Фамилия": ["Иванов", "Лазарев", "Петрова", "Надобников", "Никитин", "Иванов", "Никитина", "Никитин", "Левашев"],
           "Город проживания": ["Москва", "Омск", "Псков", "Псков", "Махачкала", "Псков", "Махачкала", "Махачкала", "Москва"],
           "Год рождения": [2000, 1987, 2003, 1993, 2001, 2001, 1976, 1969, 1999],
           "Месяц рождения": [6, 4, 11, 12, 9, 9, 5, 3, 6],
           "Число рождения": [11, 25, 5, 3, 27, 31, 13, 28, 24],
           "Статус": ["Студент", "Работает", "Школьница", "Работает", "Студент", "Работает", "Работает", "Работает", "Студент"]}

dictionary.update(update1)
i = 0
for key, value in dictionary.items():
    print(f"Фамилия Имя: {dictionary["Фамилия"][i]}--{dictionary["Имя"][i]}\nДата рождения: {dictionary["Год рождения"][i]}-{dictionary["Месяц рождения"][i]}-{dictionary["Число рождения"][i]}\nГород проживания: {dictionary["Город проживания"][i]} \nСтатус: {dictionary["Статус"][i]}")
    i += 1
